# Cable Size Id Property

Source: https://www.revitapidocs.com/2026/9ce6d43e-0f9e-c384-0731-3d51d8a94b4a.htm

---

| Cable Size Id Property |
| --- |

The Cable Size id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId Id { get; }
```

```
Public ReadOnly Property Id As ElementId
	Get
```

```
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

```
member Id : ElementId with get
```

#### Property Value

ElementId See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace